Revit 2027 API
FilterableValueProvider.GetAssociatedGlobalParameterValue Method
 Gets a global parameter value associated with a parameter from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetAssociatedGlobalParameterValue(
	Element element
)
Public Function GetAssociatedGlobalParameterValue (
	element As Element
) As ElementId
public:
ElementId^ GetAssociatedGlobalParameterValue(
	Element^ element
)
member GetAssociatedGlobalParameterValue :
        element : Element -> ElementId
Parameters
element Element
 The element to query.
Return Value
ElementId
 The associated global parameter.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterableValueProvider Class
Autodesk.Revit.DB Namespace